app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 5).order("created_at DESC")
---
SELECT  "articles".* FROM "articles"  ORDER BY created_at DESC LIMIT 5 OFFSET 0

  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hi, Im Mike"], ["body", "this is my body text"], ["user_id", 1], ["created_at", "2017-04-02 03:24:52.497888"], ["updated_at", "2017-04-02 03:24:52.497888"]]